{"format": "layers-model", "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v1.7.2", "modelTopology": {"keras_version": "2.3.1", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"name": "dropout_4", "class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"name": "conv2d_8", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"name": "max_pooling2d_4", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"name": "dropout_5", "class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"name": "conv2d_10", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"name": "conv2d_transpose_1", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}], ["conv2d_8", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"name": "conv2d_11", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"name": "conv2d_12", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "conv2d_transpose_2", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "concatenate_2", "class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}], ["conv2d_6", 0, 0, {}]]]}, {"name": "conv2d_13", "class_name": "Conv2D", "config": {"name": "conv2d_13", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"name": "conv2d_14", "class_name": "Conv2D", "config": {"name": "conv2d_14", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"name": "conv2d_transpose_3", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"name": "concatenate_3", "class_name": "Concatenate", "config": {"name": "concatenate_3", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}], ["conv2d_4", 0, 0, {}]]]}, {"name": "conv2d_15", "class_name": "Conv2D", "config": {"name": "conv2d_15", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"name": "conv2d_16", "class_name": "Conv2D", "config": {"name": "conv2d_16", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"name": "conv2d_transpose_4", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_4", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"name": "concatenate_4", "class_name": "Concatenate", "config": {"name": "concatenate_4", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["conv2d_transpose_4", 0, 0, {}], ["conv2d_2", 0, 0, {}]]]}, {"name": "conv2d_17", "class_name": "Conv2D", "config": {"name": "conv2d_17", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"name": "conv2d_18", "class_name": "Conv2D", "config": {"name": "conv2d_18", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"name": "conv2d_19", "class_name": "Conv2D", "config": {"name": "conv2d_19", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["conv2d_19", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_1/kernel", "shape": [3, 3, 3, 16], "dtype": "float32", "quantization": {"min": -9.178917295988976, "scale": 0.0001554089243009833, "dtype": "uint16"}}, {"name": "conv2d_1/bias", "shape": [16], "dtype": "float32", "quantization": {"min": -0.47782566153940387, "scale": 9.027842758830937e-06, "dtype": "uint16"}}, {"name": "conv2d_10/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"min": -2.3751439379656207, "scale": 5.63284147883513e-05, "dtype": "uint16"}}, {"name": "conv2d_10/bias", "shape": [256], "dtype": "float32", "quantization": {"min": -0.6540544485512866, "scale": 3.222895676314608e-05, "dtype": "uint16"}}, {"name": "conv2d_11/kernel", "shape": [3, 3, 256, 128], "dtype": "float32", "quantization": {"min": -6.75884862397586, "scale": 0.00016241766290132792, "dtype": "uint16"}}, {"name": "conv2d_11/bias", "shape": [128], "dtype": "float32", "quantization": {"min": -1.9773004741192848, "scale": 5.149622298927741e-05, "dtype": "uint16"}}, {"name": "conv2d_12/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"min": -2.4232234036585028, "scale": 5.173295624898065e-05, "dtype": "uint16"}}, {"name": "conv2d_12/bias", "shape": [128], "dtype": "float32", "quantization": {"min": -1.0460330829327864, "scale": 4.9929980092257104e-05, "dtype": "uint16"}}, {"name": "conv2d_13/kernel", "shape": [3, 3, 128, 64], "dtype": "float32", "quantization": {"min": -8.350186975376824, "scale": 0.0002176511657859201, "dtype": "uint16"}}, {"name": "conv2d_13/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -4.010957844233526, "scale": 0.00010723626030621944, "dtype": "uint16"}}, {"name": "conv2d_14/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -3.8788478150360097, "scale": 7.79714920504957e-05, "dtype": "uint16"}}, {"name": "conv2d_14/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -2.708031453494759, "scale": 8.86484042652468e-05, "dtype": "uint16"}}, {"name": "conv2d_15/kernel", "shape": [3, 3, 64, 32], "dtype": "float32", "quantization": {"min": -10.001728332241877, "scale": 0.00021962995086062225, "dtype": "uint16"}}, {"name": "conv2d_15/bias", "shape": [32], "dtype": "float32", "quantization": {"min": -9.996166295343855, "scale": 0.00020956762815454945, "dtype": "uint16"}}, {"name": "conv2d_16/kernel", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"min": -4.191945693363193, "scale": 8.179725439750221e-05, "dtype": "uint16"}}, {"name": "conv2d_16/bias", "shape": [32], "dtype": "float32", "quantization": {"min": -5.2935798502263065, "scale": 0.0001289450186399607, "dtype": "uint16"}}, {"name": "conv2d_17/kernel", "shape": [3, 3, 32, 16], "dtype": "float32", "quantization": {"min": -12.321009754707113, "scale": 0.00029144907758029835, "dtype": "uint16"}}, {"name": "conv2d_17/bias", "shape": [16], "dtype": "float32", "quantization": {"min": -1.8108934941913548, "scale": 5.966306978753805e-05, "dtype": "uint16"}}, {"name": "conv2d_18/kernel", "shape": [3, 3, 16, 16], "dtype": "float32", "quantization": {"min": -4.388268041665288, "scale": 0.0001453405770100781, "dtype": "uint16"}}, {"name": "conv2d_18/bias", "shape": [16], "dtype": "float32", "quantization": {"min": -5.881042787344222, "scale": 0.0001407217359146301, "dtype": "uint16"}}, {"name": "conv2d_19/kernel", "shape": [1, 1, 16, 1], "dtype": "float32", "quantization": {"min": -0.2787486020167814, "scale": 6.396103852981378e-06, "dtype": "uint16"}}, {"name": "conv2d_19/bias", "shape": [1], "dtype": "float32", "quantization": {"min": 0.14843828976154327, "scale": 1.0, "dtype": "uint16"}}, {"name": "conv2d_2/kernel", "shape": [3, 3, 16, 16], "dtype": "float32", "quantization": {"min": -4.894364853178853, "scale": 0.00010306529761579459, "dtype": "uint16"}}, {"name": "conv2d_2/bias", "shape": [16], "dtype": "float32", "quantization": {"min": -0.7398280857110848, "scale": 1.544945571263777e-05, "dtype": "uint16"}}, {"name": "conv2d_3/kernel", "shape": [3, 3, 16, 32], "dtype": "float32", "quantization": {"min": -2.5383281954422396, "scale": 5.856779408034702e-05, "dtype": "uint16"}}, {"name": "conv2d_3/bias", "shape": [32], "dtype": "float32", "quantization": {"min": -0.9870106493561784, "scale": 2.5970547279467923e-05, "dtype": "uint16"}}, {"name": "conv2d_4/kernel", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"min": -2.0525480178834608, "scale": 5.5469773204428313e-05, "dtype": "uint16"}}, {"name": "conv2d_4/bias", "shape": [32], "dtype": "float32", "quantization": {"min": -3.3966843571098644, "scale": 8.907466910838026e-05, "dtype": "uint16"}}, {"name": "conv2d_5/kernel", "shape": [3, 3, 32, 64], "dtype": "float32", "quantization": {"min": -2.3512871557509154, "scale": 5.41073075237232e-05, "dtype": "uint16"}}, {"name": "conv2d_5/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -1.3978667996827767, "scale": 4.852861654861228e-05, "dtype": "uint16"}}, {"name": "conv2d_6/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -2.397060167783093, "scale": 5.969221226145112e-05, "dtype": "uint16"}}, {"name": "conv2d_6/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -2.5034476850874468, "scale": 8.573450976326872e-05, "dtype": "uint16"}}, {"name": "conv2d_7/kernel", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"min": -2.2329044389990305, "scale": 5.5884083466789235e-05, "dtype": "uint16"}}, {"name": "conv2d_7/bias", "shape": [128], "dtype": "float32", "quantization": {"min": -0.8599302725050862, "scale": 4.2505574242750546e-05, "dtype": "uint16"}}, {"name": "conv2d_8/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"min": -2.2307275786937906, "scale": 6.102887882178241e-05, "dtype": "uint16"}}, {"name": "conv2d_8/bias", "shape": [128], "dtype": "float32", "quantization": {"min": -1.269765491970182, "scale": 7.383216024945819e-05, "dtype": "uint16"}}, {"name": "conv2d_9/kernel", "shape": [3, 3, 128, 256], "dtype": "float32", "quantization": {"min": -2.7306133027770496, "scale": 6.833195622674731e-05, "dtype": "uint16"}}, {"name": "conv2d_9/bias", "shape": [256], "dtype": "float32", "quantization": {"min": -1.7485146804160399, "scale": 4.880166011934578e-05, "dtype": "uint16"}}, {"name": "conv2d_transpose_1/kernel", "shape": [2, 2, 128, 256], "dtype": "float32", "quantization": {"min": -0.9750236945939189, "scale": 2.8459535744130733e-05, "dtype": "uint16"}}, {"name": "conv2d_transpose_1/bias", "shape": [128], "dtype": "float32", "quantization": {"min": -2.5904626751579065, "scale": 0.00010630155833878724, "dtype": "uint16"}}, {"name": "conv2d_transpose_2/kernel", "shape": [2, 2, 64, 128], "dtype": "float32", "quantization": {"min": -0.6816851783646429, "scale": 1.8656372050812636e-05, "dtype": "uint16"}}, {"name": "conv2d_transpose_2/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -8.326391945465883, "scale": 0.00024842294792093217, "dtype": "uint16"}}, {"name": "conv2d_transpose_3/kernel", "shape": [2, 2, 32, 64], "dtype": "float32", "quantization": {"min": -0.450553195833696, "scale": 1.3807520328328767e-05, "dtype": "uint16"}}, {"name": "conv2d_transpose_3/bias", "shape": [32], "dtype": "float32", "quantization": {"min": -6.822879920082561, "scale": 0.0001408463713323678, "dtype": "uint16"}}, {"name": "conv2d_transpose_4/kernel", "shape": [2, 2, 16, 32], "dtype": "float32", "quantization": {"min": -0.232196123154165, "scale": 6.72681276882105e-06, "dtype": "uint16"}}, {"name": "conv2d_transpose_4/bias", "shape": [16], "dtype": "float32", "quantization": {"min": -4.329500140344886, "scale": 7.26231236638635e-05, "dtype": "uint16"}}]}]}